# Tap
tap "heroku/brew"
tap "homebrew/aliases"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "wez/wezterm"

# -------------------------------------------------
# TERMINAL
# -------------------------------------------------

brew "autojump"           # Shell extension to jump to frequently used directories
brew "exa"                # Modern replacement for 'ls'
brew "fish"               # User-friendly command-line shell for UNIX-like operating systems
brew "bat"                # Clone of cat(1) with syntax highlighting and Git integration
brew "fzy"                # Fast, simple fuzzy text selector with an advanced scoring algorithm
brew "ghq"                # Remote repository management made easy
brew "fd"                 # simple, fast and user-friendly alternative to find
brew "macchina"           # System information fetcher, with an emphasis on performance and minimalism
brew "peco"               # Simplistic interactive filtering tool
brew "neovim"             # Ambitious Vim-fork focused on extensibility and agility
brew "tmux"               # Terminal multiplexer

cask "kitty"                      # Cross-platform, fast, feature-rich, GPU based terminal
cask "alacritty"                  # GPU-accelerated terminal emulator
cask "iterm2"                     # Terminal emulator as alternative to Apple's Terminal app
cask "wezterm"                    #  GPU-accelerated cross-platform terminal emulator and multiplexer

# -------------------------------------------------
# DEVELOPMETS 
# -------------------------------------------------

cask "android-platform-tools"     # Android SDK component
brew "gradle"                     # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "hugo"                       # Configurable static site generator
brew "kotlin"                     # Statically typed programming language for the JVM
brew "cocoapods"                  # Dependency manager for Cocoa projects
brew "ruby"                       # Powerful, clean, object-oriented scripting language
brew "watchman"                   # Watch files and take action when they change
brew "heroku/brew/heroku"         # Everything you need to get started with Heroku
brew "gh"                         # GitHub command-line tool
brew "wget"                       # Internet file retriever
brew "mongodb/brew/mongodb-database-tools"  # This package contains standard utilities for interacting with MongoDB.
brew "node"
brew "yarn"
brew "php"
brew "composer"
brew "mysql"
brew "git"

# -------------------------------------------------
# BACKUP TOOLS
# -------------------------------------------------

brew "rcm"                  # RC file (dotfile) management
brew "mas"                  # Mac App Store command-line interface
brew "mackup"               # Keep your Mac's application settings in sync

# -------------------------------------------------
# UTILS 
# -------------------------------------------------

brew "youtube-dl"           # Download YouTube videos from the command-line
brew "blueutil"             # Get/set bluetooth power and discoverable state
brew "folly"                # Collection of reusable C++ library artifacts developed at Facebook
brew "glib"                 # Core application library for C
brew "gnu-sed"              # GNU implementation of the famous stream editor
brew "m-cli"                # Swiss Army Knife for macOS
brew "ntfs-2g"              # Read-write NTFS driver for FUSE
brew "ripgrep"              # Search tool like grep and The Silver Searcher
cask "osxfuse"              # File system integration
cask "webpquicklook"        # Enable .webp to be shown in Quick Look App
cask "qlmarkdown"           # Enable rendered markdown to be shown in Quick Look App
cask "quicklook-json"           # Enable formatted json to be shown in Quick Look App
brew "ffmpeg"

# -------------------------------------------------
# FONTS 
# -------------------------------------------------

cask "font-hack-nerd-font"       
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# -------------------------------------------------
# REGULAR APPS
# -------------------------------------------------

cask "alt-tab"
cask "lulu"
cask "google-chrome"
cask "visual-studio-code"
cask "postman"
cask "tableplus"
cask "sequel-pro"
cask "figma"
cask "docker"
cask "alfred"
cask "protonvpn"
cask "vlc"
cask "rectangle"
cask "qbittorrent"
cask "slack"

# Safari Extensions
mas "AdBlock", id: 1402042596
mas "JSONPeep", id: 1458969831
mas "MeddleMonkey", id: 1539631953

# Menubar
mas "Guidance", id: 412759995
mas "AS Timer", id: 512464723
mas "Brightness Slider", id: 456624497
mas "ColorSlurp", id: 1287239339
mas "CopyClip", id: 595191960
mas "Ethernet Status", id: 1186187538
mas "Hidden Bar", id: 1452453066
mas "TinyStopwatch", id: 1447754003
mas "Kelir", id: 1145215534
mas "Lightshot Screenshot", id: 526298438
mas "Mini Calendar", id: 1088779979

# Apps
mas "HandShaker", id: 1012930195
mas "GIPHY CAPTURE", id: 668208984
mas "Memo", id: 1212409035
mas "New File Menu Free", id: 1066302071
mas "Quick Camera", id: 598853070
mas "Quick Note", id: 1472935217
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
